In [38]:
import pandas as pd
import numpy as np

In [39]:
pd.read_csv('sample.csv')

   Age  Insulin  Skin Thickness  Diabetes  Thryoid
0   10        1               1         0     12.0
1   35        2               2         1      NaN

In [72]:
dict1={"A":[1,2,3],"B":[1,2,np.nan],"C":[1,np.nan,2]}
df=pd.DataFrame(dict1)
df

   A    B    C
0  1  1.0  1.0
1  2  2.0  NaN
2  3  NaN  2.0

In [76]:
dict1={"A":[1,2,3],"B":[1,2,np.nan],"C":[1,np.nan,2]}
df=pd.DataFrame(dict1)
df['States']='DL MI BL'.split()
df

   A    B    C States
0  1  1.0  1.0     DL
1  2  2.0  NaN     MI
2  3  NaN  2.0     BL

# Inplace
Inplace is just an argument passed in pandas and it will make the change permanent to the existing dataframe if inplace=True.

If the inplace=False, then that changes will be a temporary change not reflected in the existing dataframe and we can store that change with the help of a new dataframe.

In [67]:
df_copy=df.set_index('States')
df_copy

        A    B    C
States
DL      1  1.0  1.0
MI      2  2.0  NaN
BL      3  NaN  2.0

In [77]:
df.set_index('States',inplace=True)
df

        A    B    C
States
DL      1  1.0  1.0
MI      2  2.0  NaN
BL      3  NaN  2.0

In [78]:
df

        A    B    C
States
DL      1  1.0  1.0
MI      2  2.0  NaN
BL      3  NaN  2.0

# Axis in Pandas

Axis=0 represents the rows
Axis=1 represents the columns

In [79]:
print("Dropping any row with NaN value\n",'-'*10)
df.dropna(axis=0)

Dropping any row with NaN value
 ----------

        A    B    C
States
DL      1  1.0  1.0

# NaN----> Not a Number

NaN is used for the missing numbers in the dataframe and its a numeric data type

In [80]:
print("Dropping any columns with NaN value\n",'-'*10)
df.dropna(axis=1)

Dropping any columns with NaN value
 ----------

        A
States
DL      1
MI      2
BL      3

In [81]:
df

        A    B    C
States
DL      1  1.0  1.0
MI      2  2.0  NaN
BL      3  NaN  2.0

In [82]:
print("Filling Nan values with any value")
df.fillna(value='Upgrad')

Filling Nan values with any value

        A       B       C
States
DL      1     1.0     1.0
MI      2     2.0  Upgrad
BL      3  Upgrad     2.0

In [84]:
df.fillna(value='Rishi')

        A      B      C
States
DL      1    1.0    1.0
MI      2    2.0  Rishi
BL      3  Rishi    2.0

Mean= (Sum of all observations/ Total Observations)

In [87]:
df

        A    B    C
States
DL      1  1.0  1.0
MI      2  2.0  NaN
BL      3  NaN  2.0

In [91]:
df['A'].mean()

2.0

In [94]:
print("Filling values with a mean of Column A here\n",'*'*30)

df.fillna(value=df['A'].mean())

Filling values with a mean of Column A here
 ******************************

        A    B    C
States
DL      1  1.0  1.0
MI      2  2.0  2.0
BL      3  2.0  2.0

In [96]:
np.mean(df['A']) #This is numpy

2.0

In [97]:
df

        A    B    C
States
DL      1  1.0  1.0
MI      2  2.0  NaN
BL      3  NaN  2.0

In [99]:
df.to_csv('Final.csv') #This stores the dataframe into a csv file

In [119]:
dict2={'Company':['Google',"Microsoft","Amazon","Apple","Google","Apple","Amazon"],
       "Person":["Sandeep","Ankush","Aniket","Rishi","Yash","Anand","Ragapriya"],
       "Sales":[200,120,150,300,200,150,334],"Revenue":[300,133,22,121,32,21,32]}

In [120]:
df_new=pd.DataFrame(dict2)
df_new

     Company     Person  Sales  Revenue
0     Google    Sandeep    200      300
1  Microsoft     Ankush    120      133
2     Amazon     Aniket    150       22
3      Apple      Rishi    300      121
4     Google       Yash    200       32
5      Apple      Anand    150       21
6     Amazon  Ragapriya    334       32

In [121]:
print("Grouping by the Company column and listing the mean sales\n",'-'*20)

bycomp=df_new.groupby('Company')
df1=bycomp.mean()
df1

Grouping by the Company column and listing the mean sales
 --------------------

           Sales  Revenue
Company
Amazon     242.0     27.0
Apple      225.0     71.0
Google     200.0    166.0
Microsoft  120.0    133.0

In [123]:
df_new.groupby('Company')['Sales'].mean()

           Sales  Revenue
Company
Amazon     242.0     27.0
Apple      225.0     71.0
Google     200.0    166.0
Microsoft  120.0    133.0

In [124]:
df_new.groupby('Company')['Sales'].size()

Company
Amazon       2
Apple        2
Google       2
Microsoft    1
Name: Sales, dtype: int64

In [117]:
bycomp=df_new.groupby('Company')
df2=bycomp.sum()
df2

           Sales
Company
Amazon       484
Apple        450
Google       400
Microsoft    120

In [125]:
df_new

     Company     Person  Sales  Revenue
0     Google    Sandeep    200      300
1  Microsoft     Ankush    120      133
2     Amazon     Aniket    150       22
3      Apple      Rishi    300      121
4     Google       Yash    200       32
5      Apple      Anand    150       21
6     Amazon  Ragapriya    334       32

# .loc and .iloc
They are just a type of slide of data from the dataframe

1.loc: it is label based selected method that is we have to pass the name of the or column which we want to select.

In [140]:
#lOC IS USED TO selecte the specific rows and columns
df_new.loc[0:3] # I am selecting rows from 0 to 2

     Company   Person  Sales  Revenue
0     Google  Sandeep    200      300
1  Microsoft   Ankush    120      133
2     Amazon   Aniket    150       22
3      Apple    Rishi    300      121

In [141]:
# I want the name of companies which have sales greater than 150

df_new.loc[df_new['Sales']>150]

  Company     Person  Sales  Revenue
0  Google    Sandeep    200      300
3   Apple      Rishi    300      121
4  Google       Yash    200       32
6  Amazon  Ragapriya    334       32

In [144]:
df_new.loc[df_new['Person']=='Sandeep']

  Company   Person  Sales  Revenue
0  Google  Sandeep    200      300

In [145]:
df_new

     Company     Person  Sales  Revenue
0     Google    Sandeep    200      300
1  Microsoft     Ankush    120      133
2     Amazon     Aniket    150       22
3      Apple      Rishi    300      121
4     Google       Yash    200       32
5      Apple      Anand    150       21
6     Amazon  Ragapriya    334       32

In [146]:
df_new['Company'] #select a specific column

0       Google
1    Microsoft
2       Amazon
3        Apple
4       Google
5        Apple
6       Amazon
Name: Company, dtype: object

In [150]:
#Q1. Select row 1,2,3 using loc
df_new.loc[1:3]

     Company  Person  Sales  Revenue
1  Microsoft  Ankush    120      133
2     Amazon  Aniket    150       22
3      Apple   Rishi    300      121

In [153]:
df_new[1:4]

     Company  Person  Sales  Revenue
1  Microsoft  Ankush    120      133
2     Amazon  Aniket    150       22
3      Apple   Rishi    300      121

In [155]:
# Q2.Select the rows where revenue is>75 using loc

df_new.loc[df_new['Revenue']>75]

     Company   Person  Sales  Revenue
0     Google  Sandeep    200      300
1  Microsoft   Ankush    120      133
3      Apple    Rishi    300      121

In [192]:
df_new.groupby('Company').mean().loc[['Google','Apple']]

         Sales  Revenue
Company
Google   200.0    166.0
Apple    225.0     71.0

# .iloc---> iloc is a index based selecting method which means we have to pass integer in the method to select a row/columns

In [171]:
df_new.iloc[0:2,:]

     Company   Person  Sales  Revenue
0     Google  Sandeep    200      300
1  Microsoft   Ankush    120      133

In [175]:
df_new

     Company     Person  Sales  Revenue
0     Google    Sandeep    200      300
1  Microsoft     Ankush    120      133
2     Amazon     Aniket    150       22
3      Apple      Rishi    300      121
4     Google       Yash    200       32
5      Apple      Anand    150       21
6     Amazon  Ragapriya    334       32

In [182]:
df_new.loc[1:3]["Sales"]

1    120
2    150
3    300
Name: Sales, dtype: int64

In [190]:
df_new.iloc[1:3,2]

1    120
2    150
Name: Sales, dtype: int64

# Difference between .iloc and .loc

1. .loc is a label based selecting method whereas .iloc is a indexing based method that means for .loc 
I have to give the name of the column

2. .loc have the index as inclusive whereas .iloc have the indexing as exclusive

In [195]:
df_new.loc[df_new['Company']!='Google']

     Company     Person  Sales  Revenue
1  Microsoft     Ankush    120      133
2     Amazon     Aniket    150       22
3      Apple      Rishi    300      121
5      Apple      Anand    150       21
6     Amazon  Ragapriya    334       32

In [200]:
dict1={"A":["A0","A1","A2","A3"],
                 "B":["B0","B1","B2","B3"],
       "C":["C0","C1","C2","C3"]}

In [201]:
df1=pd.DataFrame(dict1)
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [202]:
dict2={"A":["A4","A5","A7","A6"],
                 "B":["B0","B4","B22","B33"],
       "C":["C0","C1332","C23","C334"]}

In [203]:
df2=pd.DataFrame(dict2)

In [204]:
df2

    A    B      C
0  A4   B0     C0
1  A5   B4  C1332
2  A7  B22    C23
3  A6  B33   C334

In [205]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [214]:
df3=pd.concat([df1,df2],axis=0)
df3.reset_index(inplace=True)
df3.drop(columns=['index'],inplace=True)
df3

    A    B      C
0  A0   B0     C0
1  A1   B1     C1
2  A2   B2     C2
3  A3   B3     C3
4  A4   B0     C0
5  A5   B4  C1332
6  A7  B22    C23
7  A6  B33   C334

In [213]:
df3.loc[2]

index     2
A        A2
B        B2
C        C2
Name: 2, dtype: object

In [215]:
df3

    A    B      C
0  A0   B0     C0
1  A1   B1     C1
2  A2   B2     C2
3  A3   B3     C3
4  A4   B0     C0
5  A5   B4  C1332
6  A7  B22    C23
7  A6  B33   C334

In [216]:
df3.drop(columns=['C']) #Drop method selects a column and remove it

    A    B
0  A0   B0
1  A1   B1
2  A2   B2
3  A3   B3
4  A4   B0
5  A5   B4
6  A7  B22
7  A6  B33

# Concatenation along the columns

In [217]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [218]:
df2

    A    B      C
0  A4   B0     C0
1  A5   B4  C1332
2  A7  B22    C23
3  A6  B33   C334

In [219]:
df3=pd.DataFrame({"D":['a1','a2','a3','a4'],"E":range(4)})
df3

    D  E
0  a1  0
1  a2  1
2  a3  2
3  a4  3

In [221]:
vertical_df=pd.concat([df2,df3],axis=1)
vertical_df

    A    B      C   D  E
0  A4   B0     C0  a1  0
1  A5   B4  C1332  a2  1
2  A7  B22    C23  a3  2
3  A6  B33   C334  a4  3

In [222]:
df3

    D  E
0  a1  0
1  a2  1
2  a3  2
3  a4  3

In [225]:
df3.drop(2)

    D  E
0  a1  0
1  a2  1
3  a4  3

# Merge two dataframes

In [241]:
dict1={"A":["A0","A1","A2","A3"],
                 "B":["B0","B1","B4","B33"],
       "E":["C0","C1","C2","C3"]}

dict2={"A":["A0","A1","A2","A6"],
                 "B":["B0","B4","B22","B33"],
       "C":["C0","C1332","C23","C334"]}

df4=pd.DataFrame(dict1)
df5=pd.DataFrame(dict2)

In [242]:
df4

    A    B   E
0  A0   B0  C0
1  A1   B1  C1
2  A2   B4  C2
3  A3  B33  C3

In [243]:
df5

    A    B      C
0  A0   B0     C0
1  A1   B4  C1332
2  A2  B22    C23
3  A6  B33   C334

In [244]:
pd.merge(df4,df5,on=['B','A'])

    A   B   E   C
0  A0  B0  C0  C0